Revit 2026 API

# BuiltInFailuresComponentRepeaterFailures Class

---

Failures related to component repeaters.

SystemObject Autodesk.Revit.DBBuiltInFailuresComponentRepeaterFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ComponentRepeaterFailures
```
```vb
Public NotInheritable Class ComponentRepeaterFailures
```
```cpp
public ref class ComponentRepeaterFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ComponentRepeaterFailures = class end
```

The BuiltInFailuresComponentRepeaterFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ComponentRepeater_InvalidFamilyOnReload | Reloaded family not appropriate for repeater. |
|  | ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater | There is only one component in this repeater. |

#### Reference

Autodesk.Revit.DB Namespace